YT Resource: https://www.youtube.com/watch?v=M-4EpNdlSuY (Codebasics)


## 00. Learning Outcomes and Questions/Ideas

01. SQLALchemy and PyMySQL library.
02. What does SQLAlchemy do?
03. What does Object Relational Mapping (ORM) do?
04. What is Paradigm?
05. What is Abstraction?
06. How to connect engine through SQLAlchemy library in python?
07. How to read table and specific columns?
08. How to execute SQL query?
09. What does `inplace` parameter do while renaming dataframe?
10. What are the parameters in to_sql() function and what do they do each? (con, index, name, if_exists)
11. What does read_sql() function do? 



#### Idea:

01. Practical usage of `inplace` parameter.
02. More examples with breakdown of `to_sql()` function.

## 01.01. Installing SQLAlchemy 

SQLAlchemy is a library that facilitates the communication between Python programs and databases.

In [7]:
pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\sy929\anaconda3\lib\site-packages (1.4.39)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\sy929\anaconda3\lib\site-packages (from sqlalchemy) (2.0.1)
Note: you may need to restart the kernel to use updated packages.

## 01.02. PyMySQL

It allows Python programs to connect to and interact with MySQL databases.

In [10]:
pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.1.0-py3-none-any.whl (44 kB)
     -------------------------------------- 44.8/44.8 kB 221.3 kB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.0
Note: you may need to restart the kernel to use updated packages.

## 02. Installing Libraries

In [8]:
import pandas as pd
import sqlalchemy

## 03. Create SQLAlchemy Engine

**01. What does SQLAlchemy Engine do?**

The SQLAlchemy Engine is a key component of the SQLAlchemy library, which is a popular Python SQL toolkit and Object-Relational Mapping (ORM) framework. The Engine provides a way to establish and manage connections to a database and perform various database operations.

(**Establish and manage connections to a database**)

**02. What does Object Relational Mapping (ORM) do?**

Object-Relational Mapping (ORM) is a programming technique that enables developers to work with relational databases using object-oriented programming (OOP) concepts and paradigms. 


ORM frameworks-

1. provide a layer of abstraction between the databases and object-oriented nature of programming languages. 
2. allow developers to interact with SQL databases using Classes and Objects instead of writing raw SQL queries.

(**Allows us to interact with SQL databases using OOP concepts**)


**03. What is paradigm?**

Fundamental principle and concept that guides the design and implementation of software system. 

(**Helps us in the design and development of software systems**)

**04. What is Abstraction?**

1. A concept in computer science that simplifies complex details.
2. Hiding unnecessary information.
3. Focuses on the essentials only. 

(**A concept in CSE that simplifies complex details and focuses only on the essentials**)

In [11]:
engine = sqlalchemy.create_engine('mysql+pymysql://root:Zizaniut56@localhost:3306/codebasics')

## 04. Read Table in a Data Frame

In [30]:
df = pd.read_sql_table('customers',engine)
df

   id     name  phone_number
0   1   Donald       1899999
1   2  Shammim       1988888
2   3     Modi     898938398
3   1   Donald       1899999
4   2  Shammim       1988888
5   3     Modi     898938398

## 04.01. Read Specific Columns

In [42]:
df = pd.read_sql_table('customers',engine,columns=["name"])
df

      name
0   Donald
1  Shammim
2     Modi
3   Donald
4  Shammim
5     Modi

## 05. Joining SQL Query

In [44]:
df = pd.read_sql_query("SELECT * FROM customers",engine)
df

   id     name  phone_number
0   1   Donald       1899999
1   2  Shammim       1988888
2   3     Modi     898938398
3   1   Donald       1899999
4   2  Shammim       1988888
5   3     Modi     898938398

In [31]:
query = """
SELECT *
FROM customers 
JOIN orders 
    ON customers.id = orders.customer_id

"""

df = pd.read_sql_query (query,engine)
df

   id     name  phone_number  id          name  amount  customer_id
0   1   Donald       1899999   2  Google Pixel     950            1
1   2  Shammim       1988888   1      Yoga Mat      20            2
2   3     Modi     898938398   3  Fossil Watch     120            3
3   1   Donald       1899999   2  Google Pixel     950            1
4   2  Shammim       1988888   1      Yoga Mat      20            2
5   3     Modi     898938398   3  Fossil Watch     120            3

## 06. Rename the dataframe


1. First, take a csv file. 
2. Work on that CSV file to rename the column name.

In [32]:
df = pd.read_csv('01. customers.csv')
df

     Customer Name  Customer Phone
0     rafael nadal      4567895647
1  maria sharapova       434534545
2   vladimir putin        89345345
3      kim un jong       123434456
4       jeff bezos       934534543
5     rahul gandhi        44324222

`Customer Name` and `Customer Phone` these two column names are not allowed. Best, we should rename their names as "name" and "phone_number"

In [33]:
df.rename(
columns = {
    'Customer Name' : 'name',
    'Customer Phone' : 'phone_number'
}, inplace = True

)


df

              name  phone_number
0     rafael nadal    4567895647
1  maria sharapova     434534545
2   vladimir putin      89345345
3      kim un jong     123434456
4       jeff bezos     934534543
5     rahul gandhi      44324222

## 07. What does `inplace` do?

`inplace` takes 'True' or 'False'. 

1. If 'True', this parameter executes modification directly on the original objects.  
2. But, if 'False' (Default Value), a new modified object is created and returned, leaving the original object unchanged. If modified, the new object is created and it is returned as a separate object.

## 08. to_sql()


Parameters:

1. **name:** Database table name,
2. **con:** connection, Here we have created a connection named engine earlier.
3. **if_exists:** There are 3 options. Append, Replace, Fail (
   Fail: If table exists, do nothing.
   Replace: If table exists, drop it. Recreate it. Insert data.
   Append: If table exists, insert data. Create if doesn't exist.
  
4. **Index: False.** Because, we don't want serial no. 0,1,2,.....

In [41]:
df.to_sql(
    name='codebasics.customers',
    con=engine,
    if_exists='replace',
    index=False
)

6

## 09. read_sql()

read_sql() is a wrapper of read_sql_table() and read_sql_query(). It brings up the convenience only in the SQL query execution through Python.

In [46]:
df = pd.read_sql('customers',engine)
df

   id     name  phone_number
0   1   Donald       1899999
1   2  Shammim       1988888
2   3     Modi     898938398
3   1   Donald       1899999
4   2  Shammim       1988888
5   3     Modi     898938398

In [47]:
df = pd.read_sql('SELECT * FROM orders',engine)
df

   id          name  amount  customer_id
0   1      Yoga Mat      20            2
1   2  Google Pixel     950            1
2   3  Fossil Watch     120            3